@extends('layouts.app')

@section('content')
    <style>
        .service-card {
            margin-bottom: 20px;
            border: 1px solid #dee2e6;
            border-radius: 0.5rem;
        }

        .service-card-header {
            background-color: #ffffff;
            color: rgb(0, 0, 0);
            padding: 10px 15px;
            border-radius: 0.5rem 0.5rem 0 0;
        }

        .service-card-body {
            padding: 15px;
        }

        .service-title {
            margin-bottom: 0;
        }

        .card-header {
            cursor: pointer;
        }

        .list-item {
            padding: 10px;
            font-size: 0.95rem;
        }

        .list-item i {
            margin-right: 8px;
        }

        .scrollable-content {
            max-height: 200px;
            overflow-y: auto;
        }
    </style>

    <div class="container">
        <div class="card mb-4 p-4 shadow">
            <h1 class="text-center mb-4">รายละเอียดการบริการ</h1>

            @if (session('error'))
                <div class="alert alert-danger">
                    {{ session('error') }}
                </div>
            @endif

            <!-- Elderly Information -->
            <div class="row mb-4">
                <div class="col-md-6">
                    <div class="card p-3 bg-light shadow-sm">
                        <h2 class="mb-3">ข้อมูลผู้สูงอายุ</h2>
                        <p class="large-text mb-2"><strong>ชื่อ:</strong>
                            {{ $score->elderly->Title . $score->elderly->FirstName }} {{ $score->elderly->LastName }}</p>
                    </div>
                </div>
                <div class="col-md-6">
                    <div class="card p-3 bg-light shadow-sm">
                        <h2 class="mb-3">ข้อมูลคะแนน</h2>
                        <p class="large-text mb-2"><strong>กลุ่ม:</strong> {{ $score->group->name ?? 'N/A' }}</p>
                        <p class="large-text"><strong>กลุ่มใหญ่:</strong>
                            @php
                                $groupName = $score->group->name ?? 'N/A';
                                $displayText = 'ยังไม่ได้ประเมิน';

                                if (in_array($groupName, ['B5', 'B4', 'B3'])) {
                                    $displayText = 'กลุ่มปกติ';
                                } elseif (in_array($groupName, ['C4', 'C3', 'C2'])) {
                                    $displayText = 'กลุ่มติดบ้าน';
                                } elseif (in_array($groupName, ['I3', 'I2', 'I1'])) {
                                    $displayText = 'กลุ่มติดเตียง';
                                }
                            @endphp
                            {{ $displayText }}</p>
                        </p>
                    </div>
                </div>
            </div>
        </div>

        <!-- Service Details -->
        <h3 class="mb-4">ชุดการบริการ การดูแลตามความต้องการ</h3>
        @php
            $services = [
                'B3' => [
                    '1.การประเมิน วางแผน การรักษา และดูแล' => [
                        ' - รวมประเมิน วางแผนการดูแล กับทีมสหสาขาวิชาชีพ',
                        ' - ให้คำปรึกษา',
                    ],
                    '2.การดูแลด้านการพยาบาล' => [' -การดูแลด้านการพยาบาลตามมาตรฐานการให้การพยาบาลที่บ้าน'],
                    '3.การดูแลด้านเภสัชกรรม' => [' - แนะนำการใช้ยาตามภาวะโรค'],
                    '4.การฟื้นฟูสมรรถภาพ หมายเหตุมีงบบริการฟื้นฟูสมรรถภาพด้านการแพทย์' => [
                        ' - ประเมินระดับความบกพร่อง/ความพร้อมของร่างกาย',
                        ' - วางแผน/ให้ความรู้เพื่อเข้าถึงบริการตามชุดสิทธิประโยชน์',
                        ' - แนะนำและประสานการปรับสภาพแวดล้อมเพื่อการใช้ชีวิตอย่างปกติ',
                        ' - ประเมิน/ป้องกันการหกล้ม และอุบัติเหตุอื่น',
                        ' - สนับสนุน/จัดหาอุปกรณ์เครื่องช่วยเพื่อการฟื้นฟูอย่างเต็มศักยภาพ',
                    ],
                    '5.การดูแลด้านสุขภาพจิต' => [
                        ' - ประเมินด้านสุขภาพจิต',
                        ' - ให้คำแนะนำ/วางแผนการดูแลตามอาการ',
                        ' - ป้องกันภาวะสมองเสื่อม',
                        ' - ป้องกันภาวะซึมเศร้า',
                    ],
                    '6.การดูแลด้านสุขภาพช่องปาก' => [' - ให้บริการด้านทัตกรรมตามชุดสิทธิประโยชน์'],
                    '7.การดูแลด้านโภชนาการ' => [
                        ' - ประเมินด้านความสามารถในการกลืน การบดเคี้ยวและอื่นๆ',
                        ' - ประเมินและให้ความรู้ด้านโภชนาการ',
                    ],
                    '8.การดูแลด้านการแพทย์ แผนไทย/ทางเลือก หมายเหตุ:มีงบบริการแพทย์แผนไทย' => [
                        ' - ประเมิน/ให้ความรู้ด้านการใช้สมุนไพรเพื่อการพึ่งตนเองแก่ผู้สูงอายุและผู้ดูแล',
                        ' - แนะนำการเข้าถึงบริการแพทย์แผนไทยตามชุดสิทธิประโยชน์',
                        ' - จัดบริการที่บ้านเพื่อส่งเสริมสุขภาพและฟื้นฟูสมรรถภาพ',
                    ],
                ],
                'C4' => [
                    '1.การประเมิน วางแผนการรักษา และดูแล' => [
                        ' - ร่วมประเมิน วางแผนการดูแล กับทีมสหสาขาวิชาชีพ',
                        ' - ให้คำปรึกษา',
                        ' - เยี่ยมดูแลที่บ้านตามความจำเป็น',
                    ],
                    '2.การดูแลด้านการพยาบาล' => [
                        ' - การดูแลด้านการพยาบาลตามมาตรฐานการให้การพยาบาลที่บ้าน',
                        ' - ให้คำแนะนำในการจัดสภาพแวดล้อมที่ปลอดภัยแก่ผู้สูงอายุสมองเสื่อม',
                    ],
                    '3.การดูแลด้านเภสัชกรรม' => [' - แนะนำการใช้ยาตามภาวะโรค ให้ความรู้ แก้ผู้ดูและญาติ'],
                    '4.การฟื้นฟูสมรรถภาพ หมายเหตุ:มีงบบริการฟื้นฟูสมรรถภาพด้านการแพทย์' => [
                        ' - ประเมินระดับความบกพร่อง/ความพร้อมของร่างกาย',
                        ' - วางแผน/ให้ความรู้เพื่อเข้าถึงบริการตามชุดสิทธิประโยชน์',
                        ' - แนะนำและประสานการปรับสภาพแวดล้อมเพื่อการใช้ชีวิตอย่างปกติและปลอดภัย',
                        ' - ประเมิน/ป้องกันการหกล้ม และอุบัติเหตุอื่น',
                        ' - ให้คำแนะนำแก่ผู้ดูแล/ญาติตามความจำเป็นรายกรณี',
                        ' - สนับสนุน/จัดหาอุปกรณ์เครื่องช่วยเพื่อการฟื้นฟูอย่างเต็มศักยภาพ',
                    ],
                    '5.การดูแลด้านสุขภาพจิต' => [
                        ' - ประเมินด้านสุขภาพจิต',
                        ' - ให้คำแนะนำ/วางแผนการดูแลตามอาการ',
                        ' - ให้คำแนะนำการดูแลแก่ผู้ดูแลและญาติ',
                        ' - ป้องกันพฤติกรรมที่เป็นปัญหา ชะลอภาวะสมองเสื่อม',
                        ' - ป้องกันภาวะซึมเศร้า',
                    ],
                    '6.การดูแลด้านสุขภาพช่องปาก' => [
                        ' - ให้บริการด้านทัตกรรมตามชุดสิทธิประโยชน์',
                        ' - ให้คำแนะนำแก่ผู้ดูแล/ญาติสามารถดูแลสุขภาพช่องปากผู้สูงอายุได้',
                        ' - ประสานการส่งต่อตามความจำเป็น',
                    ],
                    '7.การดูแลด้านโภชนาการ' => [
                        ' - ประเมินด้านความสามารถในการกลืน การบดเคี้ยวและอื่นๆ',
                        ' - ประเมินและให้ความรู้ด้านโภชนาการ',
                        ' - เฝ้าระวัง วางแผนด้านโภชนาการรายบุคคล',
                        ' - แนะนำและประสานเพื่อแก้ไขภาวะขาดอาหาร',
                    ],
                    '8.การดูแลด้านการแพทย์ แผนไทย/ทางเลือก หมายเหตุ:มีงบบริการแพทย์แผนไทย' => [
                        ' - ประเมิน/ให้ความรู้ด้านการใช้สมุนไพรเพื่อการพึ่งตนเองแก่ผู้สูงอายุและผู้ดูแล',
                        ' - แนะนำการเข้าถึงบริการแพทย์แผนไทยตามชุดสิทธิประโยชน์',
                        ' - จัดบริการที่บ้านเพื่อส่งเสริมสุขภาพและฟื้นฟูสมรรถภาพ',
                    ],
                ],
                'C3' => [
                    '1.การประเมิน วางแผนการรักษา และดูแล' => [
                        ' - ร่วมประเมิน วางแผนการดูแล กับทีมสหสาขาวิชาชีพ',
                        ' - ให้คำปรึกษา',
                        ' - เยี่ยมดูแลที่บ้านตามความจำเป็น',
                    ],
                    '2.การดูแลด้านการพยาบาล' => [
                        ' - การดูแลด้านการพยาบาลตามมาตรฐานการให้การพยาบาลที่บ้าน',
                        ' - ให้คำแนะนำในการจัดสภาพแวดล้อมที่ปลอดภัยแก่ผู้สูงอายุสมองเสื่อม',
                    ],
                    '3.การดูแลด้านเภสัชกรรม' => [' - แนะนำการใช้ยาตามภาวะโรค ให้ความรู้ แก้ผู้ดูและญาติ'],
                    '4.การฟื้นฟูสมรรถภาพ หมายเหตุ:มีงบบริการฟื้นฟูสมรรถภาพด้านการแพทย์' => [
                        ' - ประเมินระดับความบกพร่อง/ความพร้อมของร่างกาย',
                        ' - วางแผน/ให้ความรู้เพื่อเข้าถึงบริการตามชุดสิทธิประโยชน์',
                        ' - แนะนำและประสานการปรับสภาพแวดล้อมเพื่อการใช้ชีวิตอย่างปกติและปลอดภัย',
                        ' - ประเมิน/ป้องกันการหกล้ม และอุบัติเหตุอื่น',
                        ' - ให้คำแนะนำแก่ผู้ดูแล/ญาติตามความจำเป็นรายกรณี',
                        ' - สนับสนุน/จัดหาอุปกรณ์เครื่องช่วยเพื่อการฟื้นฟูอย่างเต็มศักยภาพ',
                    ],
                    '5.การดูแลด้านสุขภาพจิต' => [
                        ' - ประเมินด้านสุขภาพจิต',
                        ' - ให้คำแนะนำ/วางแผนการดูแลตามอาการ',
                        ' - ให้คำแนะนำการดูแลแก่ผู้ดูแลและญาติ',
                        ' - ป้องกันพฤติกรรมที่เป็นปัญหา ชะลอภาวะสมองเสื่อม',
                        ' - ป้องกันภาวะซึมเศร้า',
                    ],
                    '6.การดูแลด้านสุขภาพช่องปาก' => [
                        ' - ให้บริการด้านทัตกรรมตามชุดสิทธิประโยชน์',
                        ' - ให้คำแนะนำแก่ผู้ดูแล/ญาติสามารถดูแลสุขภาพช่องปากผู้สูงอายุได้',
                        ' - ประสานการส่งต่อตามความจำเป็น',
                    ],
                    '7.การดูแลด้านโภชนาการ' => [
                        ' - ประเมินด้านความสามารถในการกลืน การบดเคี้ยวและอื่นๆ',
                        ' - ประเมินและให้ความรู้ด้านโภชนาการ',
                        ' - เฝ้าระวัง วางแผนด้านโภชนาการรายบุคคล',
                        ' - แนะนำและประสานเพื่อแก้ไขภาวะขาดอาหาร',
                    ],
                    '8.การดูแลด้านการแพทย์ แผนไทย/ทางเลือก หมายเหตุ:มีงบบริการแพทย์แผนไทย' => [
                        ' - ประเมิน/ให้ความรู้ด้านการใช้สมุนไพรเพื่อการพึ่งตนเองแก่ผู้สูงอายุและผู้ดูแล',
                        ' - แนะนำการเข้าถึงบริการแพทย์แผนไทยตามชุดสิทธิประโยชน์',
                        ' - จัดบริการที่บ้านเพื่อส่งเสริมสุขภาพและฟื้นฟูสมรรถภาพ',
                    ],
                ],
                'C2' => [
                    '1.การประเมิน วางแผนการรักษา และดูแล' => [
                        ' - ร่วมประเมิน วางแผนการดูแล กับทีมสหสาขาวิชาชีพ',
                        ' - ให้คำปรึกษา',
                        ' - เยี่ยมดูแลที่บ้านตามความจำเป็น',
                    ],
                    '2.การดูแลด้านการพยาบาล' => [
                        ' - การดูแลด้านการพยาบาลตามมาตรฐานการให้การพยาบาลที่บ้าน',
                        ' - ให้คำแนะนำในการจัดสภาพแวดล้อมที่ปลอดภัยแก่ผู้สูงอายุสมองเสื่อม',
                    ],
                    '3.การดูแลด้านเภสัชกรรม' => [' - แนะนำการใช้ยาตามภาวะโรค ให้ความรู้ แก้ผู้ดูและญาติ'],
                    '4.การฟื้นฟูสมรรถภาพ หมายเหตุ:มีงบบริการฟื้นฟูสมรรถภาพด้านการแพทย์' => [
                        ' - ประเมินระดับความบกพร่อง/ความพร้อมของร่างกาย',
                        ' - วางแผน/ให้ความรู้เพื่อเข้าถึงบริการตามชุดสิทธิประโยชน์',
                        ' - แนะนำและประสานการปรับสภาพแวดล้อมเพื่อการใช้ชีวิตอย่างปกติและปลอดภัย',
                        ' - ประเมิน/ป้องกันการหกล้ม และอุบัติเหตุอื่น',
                        ' - ให้คำแนะนำแก่ผู้ดูแล/ญาติตามความจำเป็นรายกรณี',
                        ' - สนับสนุน/จัดหาอุปกรณ์เครื่องช่วยเพื่อการฟื้นฟูอย่างเต็มศักยภาพ',
                    ],
                    '5.การดูแลด้านสุขภาพจิต' => [
                        ' - ประเมินด้านสุขภาพจิต',
                        ' - ให้คำแนะนำ/วางแผนการดูแลตามอาการ',
                        ' - ให้คำแนะนำการดูแลแก่ผู้ดูแลและญาติ',
                        ' - ป้องกันพฤติกรรมที่เป็นปัญหา ชะลอภาวะสมองเสื่อม',
                        ' - ป้องกันภาวะซึมเศร้า',
                    ],
                    '6.การดูแลด้านสุขภาพช่องปาก' => [
                        ' - ให้บริการด้านทัตกรรมตามชุดสิทธิประโยชน์',
                        ' - ให้คำแนะนำแก่ผู้ดูแล/ญาติสามารถดูแลสุขภาพช่องปากผู้สูงอายุได้',
                        ' - ประสานการส่งต่อตามความจำเป็น',
                    ],
                    '7.การดูแลด้านโภชนาการ' => [
                        ' - ประเมินด้านความสามารถในการกลืน การบดเคี้ยวและอื่นๆ',
                        ' - ประเมินและให้ความรู้ด้านโภชนาการ',
                        ' - เฝ้าระวัง วางแผนด้านโภชนาการรายบุคคล',
                        ' - แนะนำและประสานเพื่อแก้ไขภาวะขาดอาหาร',
                    ],
                    '8.การดูแลด้านการแพทย์ แผนไทย/ทางเลือก หมายเหตุ:มีงบบริการแพทย์แผนไทย' => [
                        ' - ประเมิน/ให้ความรู้ด้านการใช้สมุนไพรเพื่อการพึ่งตนเองแก่ผู้สูงอายุและผู้ดูแล',
                        ' - แนะนำการเข้าถึงบริการแพทย์แผนไทยตามชุดสิทธิประโยชน์',
                        ' - จัดบริการที่บ้านเพื่อส่งเสริมสุขภาพและฟื้นฟูสมรรถภาพ',
                    ],
                ],
                'I3' => [
                    '1.การประเมิน วางแผนการรักษา และดูแล' => [
                        ' - ร่วมประเมิน วางแผนการดูแล กับทีมสหสาขาวิชาชีพ',
                        ' - นำทีมทำ case conference',
                        ' - เยี่ยมดูแลที่บ้านอย่างน้อย 1 ครั้ง',
                    ],
                    '2.การดูแลด้านการพยาบาล' => [
                        ' - การดูแลด้านการพยาบาลตามมาตรฐานการให้การพยาบาลที่บ้าน',
                        ' - ให้คำแนะนำในการจัดสภาพแวดล้อมที่ปลอดภัยแก่ผู้ดูแล',
                    ],
                    '3.การดูแลด้านเภสัชกรรม' => [
                        '-แนะนำการใช้ยาตามภาวะโรค ให้ความรู้ยา แก่ผู้ดูแลและญาติ(การใช้ยา การเก็บรักษาผลข้างเคียง)',
                    ],
                    '4.การฟื้นฟูสมรรถภาพ หมายเหตุ:มีงบบริการฟื้นฟูสมรรถภาพด้านการแพทย์' => [
                        ' - ประเมินระดับความบกพร่อง/ความพร้อมของร่างกาย',
                        ' - วางแผน/ให้ความรู้เพื่อเข้าถึงบริการตามชุดสิทธิประโยชน์',
                        ' - แนะนำการปรับสภาพแวดล้อมเพื่อการใช้ชีวิตอย่างปกติและปลอดภัย',
                        ' - ประเมิน/ป้องกันอุบัติเหตุเช่น ตกเตียง',
                        ' - ให้คำแนะนำแก่ผู้ดูแล/ญาติตามความจำเป็น',
                        ' - สนับสนุน/จัดหาอุปกรณ์เครื่องช่วยเพื่อการฟื้นฟูอย่างเต็มศักยภาพ',
                        ' - ป้องกันกลุ่มอาการอวัยวะไม่ได้ใช้งาน',
                    ],
                    '5.การดูแลด้านสุขภาพจิต' => [
                        ' - ประเมินด้านสุขภาพจิต',
                        ' - ให้คำแนะนำ/วางแผนการดูแลตามอาการ',
                        ' - ให้คำแนะนำการดูแลแก่ผู้ดูแลและญาติ',
                        ' - ป้องกันพฤติกรรมที่เป็นปัญหา',
                        ' - ป้องกันภาวะซึมเศร้า',
                    ],
                    '6.การดูแลด้านสุขภาพช่องปาก' => [
                        ' - ให้บริการด้านทัตกรรมตามชุดสิทธิประโยชน์',
                        ' - ให้คำแนะนำแก่ผู้ดูแล/ญาติสามารถดูแลสุขภาพช่องปากผู้สูงอายุได้',
                        ' - ประเมินสุขภาพช่องปาก',
                        ' - จัดบริการที่บ้านตามความจำเป็น',
                    ],
                    '7.การดูแลด้านโภชนาการ' => [
                        ' - ประเมินด้านความสามารถในการกลืน การบดเคี้ยวและอื่นๆ',
                        ' - ประเมินและให้ความรู้ด้านโภชนาการ',
                        ' - เฝ้าระวัง วางแผนด้านโภชนาการรายบุคคล',
                        ' - ให้ความรู้และสอนเตรียมอาหารที่เหมาะสมรายบุคคล',
                    ],
                    '8.การดูแลด้านการแพทย์ แผนไทย/ทางเลือก หมายเหตุ:มีงบบริการแพทย์แผนไทย' => [
                        ' - ประเมินและวางแผนการให้บริการตามความจำเป็น',
                        ' - ให้ความรู้และการใช้สมุนไพรเพื่อการพึ่งตนเองแก่ผู้สูงอายุและผู้ดูแล',
                        ' - แนะนำ/สอนผู้ดูแลหรือญาติให้บริการพื้นฐานได้',
                        ' - จัดบริการที่บ้านเพื่อส่งเสริมสุขภาพและฟื้นฟูสมรรถภาพ',
                    ],
                ],
                'I2' => [
                    '1.การประเมิน วางแผนการรักษา และดูแล' => [
                        ' - ร่วมประเมิน วางแผนการดูแล กับทีมสหสาขาวิชาชีพ',
                        ' - นำทีมทำ case conference เยี่ยมดูแลที่บ้านร่วมกับทีมฯอย่าง น้อย 1 ครั้ง และเยี่ยมตามความจำเป็น',
                    ],
                    '2.การดูแลด้านการพยาบาล' => [
                        ' - การดูแลด้านการพยาบาลตามมาตฐานการให้การพยาบาลที่บ้าน',
                        ' - ให้คำแนะนำในการจัดสภาพแวดล้อมที่ปลอดภัยแก่ผู้ดูแล',
                        ' - การป้องกันและดูแลแผล กดทับ',
                        ' - สนับสนุน/จัดหาวัสดุ-อุปกรณ์ การแพทย์ที่จำเป็น(medical device)',
                        ' - เน้นการให้บริการแบบองค์รวม',
                        ' - ประเมินความปวดและคุณภาพชีวิต ของผู้สูงอายุ',
                    ],
                    '3.การดูแลด้านเภสัชกรรม' => [
                        ' - วางแผน/กำกับ/รายงานการใช้ยา ลดปวดและอื่นๆที่จำเป็น โดย บุคคลากรสาธารณสุข',
                        ' - ให้ความรู้/คำแนะนการใช้ยาแก่ผู้ดูแลและญาติ(การใช้ การเก็บรักษาผลข้างเคียง)',
                    ],
                    '4.การฟื้นฟูสมรรถภาพ หมายเหตุ:มีงบบริการฟื้นฟูสมรรถภาพด้านการแพทย์' => [
                        '- วางแผน/ให้ความรู้เพื่อเข้าถึง บริการตามชุดสิทธิประโยชน์',
                        '- แนะนำการปรับ สภาพแวดล้อมเพื่อการใช้ชีวิตให้สุขสบาย',
                        '- ประเมิน/ป้องกันอุบัติเหตุเช่น ตกเตียง',
                        '- ให้คำแนะนำแก่ผู้ดูแลและญาติตามความจำเป็นรายกรณี',
                        '- ป้องกันกลุ่มอาการอวัยวะ ไม่ได้ใช้งาน',
                    ],
                    '5.การดูแลด้านสุขภาพจิต' => [
                        ' -ประเมินด้านสุขภาพจิต',
                        ' -ให้คำแนะนำ/วางแผนการ ดูแลตามอาการ',
                        ' -ให้คำแนะนำการดูแลแก่ผู้ดูแล และญาติ',
                        ' -ป้องกันพฤติกรรมที่เป็นปัญหา',
                        ' -บริการด้านจิตสังคมผู้สูงอายุและ ผู้ดูแล/ครอบครัว',
                        ' -เน้นการให้บริการแบบองค์รวมพร้อมเผชิญการตายอย่างมีศักดิ์ศรีในมิติของแต่ละความเชื่อ/ศาสนา',
                        ' -ป้องกันภาวะซึมเศร้า',
                    ],
                    '6.การดูแลด้านสุขภาพช่องปาก' => [
                        ' -ให้บริการด้านทัตกรรมตาม ชุดสิทธิประโยชน์',
                        ' -ให้คำแนะนำแก่ผู้ดูแล/ญาติ สามารถดูแลสุขภาพช่องปาก ผู้สูงอายุได้',
                        ' - ประเมินสุขภาพช่องปากโดย บุคลากรสาธารณสุข',
                        ' -จัดบริการที่บ้านตามความจำเป็น',
                    ],
                    '7.การดูแลด้านโภชนาการ' => [
                        '-ประเมินด้านความสามารถในการกลืน การบดเคี้ยวและอื่นๆ',
                        '-ประเมินและให้ความรู้ด้านโภชนาการ',
                        '-เฝ้าระวัง วางแผนด้านโภชนาการรายบุคคล',
                        '-ให้ความรู้และสอนเตรียม อาหารที่เหมาะสมแก่ผู้ป่วยรายบุคคล',
                    ],
                    '8.การดูแลด้านการแพทย์ แผนไทย/ทางเลือก หมายเหตุ:มีงบบริการแพทย์แผนไทย' => [
                        ' -ประเมินและวางแผนการให้บริการตามความจำเป็น',
                        ' -แนะนำ/สอนผู้ดูแลหรือญาติ ให้บริการพื้นฐานได้',
                        ' -จัดบริการที่บ้านโดยเน้นการดูแล เพื่อความสุขสบายของผู้สูงอายุ',
                    ],
                ],
                'I1' => [
                    '1.การประเมิน วางแผนการรักษา และดูแล' => [
                        ' - ร่วมประเมิน วางแผนการดูแล กับทีมสหสาขาวิชาชีพ',
                        ' - นำทีมทำ case conference เยี่ยมดูแลที่บ้านร่วมกับทีมฯอย่าง น้อย 1 ครั้ง และเยี่ยมตามความจำเป็น',
                    ],
                    '2.การดูแลด้านการพยาบาล' => [
                        ' - การดูแลด้านการพยาบาลตามมาตฐานการให้การพยาบาลที่บ้าน',
                        ' - ให้คำแนะนำในการจัดสภาพแวดล้อมที่ปลอดภัยแก่ผู้ดูแล',
                        ' - การป้องกันและดูแลแผล กดทับ',
                        ' - สนับสนุน/จัดหาวัสดุ-อุปกรณ์ การแพทย์ที่จำเป็น(medical device)',
                        ' - เน้นการให้บริการแบบองค์รวม',
                        ' - ประเมินความปวดและคุณภาพชีวิต ของผู้สูงอายุ',
                    ],
                    '3.การดูแลด้านเภสัชกรรม' => [
                        ' - วางแผน/กำกับ/รายงานการใช้ยา ลดปวดและอื่นๆที่จำเป็น โดย บุคคลากรสาธารณสุข',
                        ' - ให้ความรู้/คำแนะนการใช้ยาแก่ผู้ดูแลและญาติ(การใช้ การเก็บรักษาผลข้างเคียง)',
                    ],
                    '4.การฟื้นฟูสมรรถภาพ หมายเหตุ:มีงบบริการฟื้นฟูสมรรถภาพด้านการแพทย์' => [
                        '- วางแผน/ให้ความรู้เพื่อเข้าถึง บริการตามชุดสิทธิประโยชน์',
                        '- แนะนำการปรับ สภาพแวดล้อมเพื่อการใช้ชีวิตให้สุขสบาย',
                        '- ประเมิน/ป้องกันอุบัติเหตุเช่น ตกเตียง',
                        '- ให้คำแนะนำแก่ผู้ดูแลและญาติตามความจำเป็นรายกรณี',
                        '- ป้องกันกลุ่มอาการอวัยวะ ไม่ได้ใช้งาน',
                    ],
                    '5.การดูแลด้านสุขภาพจิต' => [
                        ' -ประเมินด้านสุขภาพจิต',
                        ' -ให้คำแนะนำ/วางแผนการ ดูแลตามอาการ',
                        ' -ให้คำแนะนำการดูแลแก่ผู้ดูแล และญาติ',
                        ' -ป้องกันพฤติกรรมที่เป็นปัญหา',
                        ' -บริการด้านจิตสังคมผู้สูงอายุและ ผู้ดูแล/ครอบครัว',
                        ' -เน้นการให้บริการแบบองค์รวมพร้อมเผชิญการตายอย่างมีศักดิ์ศรีในมิติของแต่ละความเชื่อ/ศาสนา',
                        ' -ป้องกันภาวะซึมเศร้า',
                    ],
                    '6.การดูแลด้านสุขภาพช่องปาก' => [
                        ' -ให้บริการด้านทัตกรรมตาม ชุดสิทธิประโยชน์',
                        ' -ให้คำแนะนำแก่ผู้ดูแล/ญาติ สามารถดูแลสุขภาพช่องปาก ผู้สูงอายุได้',
                        ' - ประเมินสุขภาพช่องปากโดย บุคลากรสาธารณสุข',
                        ' -จัดบริการที่บ้านตามความจำเป็น',
                    ],
                    '7.การดูแลด้านโภชนาการ' => [
                        '-ประเมินด้านความสามารถในการกลืน การบดเคี้ยวและอื่นๆ',
                        '-ประเมินและให้ความรู้ด้านโภชนาการ',
                        '-เฝ้าระวัง วางแผนด้านโภชนาการรายบุคคล',
                        '-ให้ความรู้และสอนเตรียม อาหารที่เหมาะสมแก่ผู้ป่วยรายบุคคล',
                    ],
                    '8.การดูแลด้านการแพทย์ แผนไทย/ทางเลือก หมายเหตุ:มีงบบริการแพทย์แผนไทย' => [
                        ' -ประเมินและวางแผนการให้บริการตามความจำเป็น',
                        ' -แนะนำ/สอนผู้ดูแลหรือญาติ ให้บริการพื้นฐานได้',
                        ' -จัดบริการที่บ้านโดยเน้นการดูแล เพื่อความสุขสบายของผู้สูงอายุ',
                    ],
                ],
            ];
        @endphp

        @foreach ($services as $group => $items)
            @if ($score->group->name === $group)
                <div class="card service-card">
                    <div class="service-card-header">
                        <h4 class="mb-0">บริการสำหรับกลุ่ม {{ $group }} ({{ $displayText }})</h4>
                    </div>
                    <div class="service-card-body">
                        @foreach ($items as $service => $details)
                            <div class="card mb-3">
                                <div class="card-header bg-white text-white" data-bs-toggle="collapse"
                                    href="#collapse-{{ Str::slug($service) }}" role="button" aria-expanded="false"
                                    aria-controls="collapse-{{ Str::slug($service) }}">
                                    <h5 class="card-title mb-0 service-title">{{ $service }}</h5>
                                </div>
                                <div class="collapse" id="collapse-{{ Str::slug($service) }}">
                                    <div class="card-body scrollable-content">
                                        <ul class="list-group list-group-flush">
                                            @foreach ($details as $detail)
                                                <li class="list-group-item list-item">
                                                    <i class="bi bi-check-circle-fill text-success"></i>
                                                    {{ $detail }}
                                                </li>
                                            @endforeach
                                        </ul>
                                    </div>
                                </div>
                            </div>
                        @endforeach
                    </div>
                </div>
            @endif
        @endforeach

        <!-- Back Button -->
        <div class="d-flex justify-content-between mt-4">
            <a href="{{ route('service.index') }}" class="btn btn-danger">ย้อนกลับ</a>
        </div>
    </div>
@endsection
